*&---------------------------------------------------------------------*
*& Include          ZDKTJ_BOM_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
 SET PF-STATUS 'STATUS100'.
 SET TITLEBAR 'T100'.

 "스크롤이 생성되기 위해 몇줄있는지 나타내 주어야 함. 그렇지 않으면 ENTER시 무한 생성 됨.
 DESCRIBE TABLE GT_BOM LINES TC100-LINES.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module MOVE_ABAP_TO_SCREEN OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE move_abap_to_screen OUTPUT.
 READ TABLE GT_BOM INTO GS_BOM INDEX TC100-CURRENT_LINE.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_TC100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_tc100 OUTPUT.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_SCREEN OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_screen OUTPUT.
  LOOP AT SCREEN.
    IF GS_BOM-PLANTCODE IS NOT INITIAL. "창고코드 적히면 입력 활성화
      IF SCREEN-NAME = 'GS_BOM-MITEMCODE'.
        SCREEN-INPUT = 1. "입력 활성화
        SCREEN-REQUIRED = '1'. "필수값 활성화
      ENDIF.
    ELSE.
      IF SCREEN-NAME = 'GS_BOM-MITEMCODE'.
        SCREEN-INPUT = 0.
        SCREEN-REQUIRED = 1.
      ENDIF.
    ENDIF.
    MODIFY SCREEN.
  ENDLOOP.
ENDMODULE.
